business_domain/quarkus/helloservice/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:hel="http://ejb.helloservice.tutorial.jakarta/">
   <soapenv:Header/>
   <soapenv:Body>
      <hel:sayHello>
         <arg0>John</arg0>
      </hel:sayHello>
   </soapenv:Body>
</soapenv:Envelope>
